/*СПРАВОЧНЫЕ МАТЕРИАЛЫ*/
 // ConsoleApplication1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
 // Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
 // Отладка программы: F5 или меню "Отладка" > "Запустить отладку"
 // Советы по началу работы 
 //  1. В окне обозревателя решений можно добавлять файлы и управлять ими.
 //  2. В окне Team Explorer можно подключиться к системе управления версиями.
 //  3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
 //  4. В окне "Список ошибок" можно просматривать ошибки.
 //  5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
 //  6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.


#include <stdio.h>
#include <string.h>
#define _USE_MATH_DEFINES
#include <math.h>
#pragma warning(disable : 4996)

/* ТЕМА: ВВОД-ВЫВОД В СИ */
//Задание 1

 int main()
{
    int x = 56, y = 31, z, z1, z2, z3, z4, z5, z6, z7, z8, z9;

    z = (x % 10 + y / 10) * 10 - x % y + x / y + 1;

    z1 = x % 10; // 56 % 10 = 6
    z2 = y / 10; // 31 / 10 = 3
    z3 = (x % 10 + y / 10); // (56 % 10 + y / 10) = 6 + 3 = 9
    z4 = (x % 10 + y / 10) * 10; // (56 % 10 + y / 10) * 10 = (6 + 3) * 10 = 90
    z5 = x % y; // 56 % 31 = 25;
    z6 = x / y; // 56 / 31 = 1
    z7 = (x % 10 + y / 10) * 10 - x % y; // 90 - 25 = 65;
    z8 = (x % 10 + y / 10) * 10 - x % y + x / y; // 90 - 25 + 1 = 66
    z9 = (x % 10 + y / 10) * 10 - x % y + x / y + 1; // 90 - 25 + 1 + 1 = 67;

    printf("%d, %d, %d\n", x, y,z);
    printf("%o %x %d", x, y, z); // o - octal; x - hexadecimal;
}
*
/* ТЕМА: ПРИОРИТЕТ И АССОЦИАТИВНОСТЬ ОПЕРАТОРОВ C */
//Задание 2
/*
int main() {
    double x = M_PI, y = 66.88;
    printf("(1) x%4.2lfy%3.1lfy+x\n", y, x); // ans = x66.88y3.1y+x
    printf("(2) x(%4.2lf)y(%3.1lf)y+x\n", y, x); // ans = x(66.88)y(3.1)y+x
    printf("(3) %4.2lf\n", y); // ans = 66.88
    printf("(4) %3.1lf\n", x); // ans = 3.1
}
*/

/* ТЕМА: ОПЕРАТОРЫ В C*/
// Задание 3
/*int main() {
    int a = 18, b = 88, c = 24, d = 38;

    //ИСХОДНЫЙ КОД
    d += (a++) + (++b) % (c--) - (--a);

    //ПОЯСНЕНИЯ ПО КОДУ
    // Сложение, совмещённое с присваиванием — Синтаксис: a += b; Значение: a = a + b.
    // Инкремент префиксный — ++a
    // Инкремент суффиксный — a++
    // Декремент префиксный — --a
    // Декремент суффиксный — a--

    //Debug
    // d1 = (a++); // a = 19
    // d2 = (++b); // b = 89
    // d3 = (c--); // c = 23
    // d4 = (--a); // a = 18
    // d5 = (++b) % (c--); // 89 % 24 = 17
    // d6 = (a++) + (++b) % (c--); // 18 + 17 = 35
    // d7 = (a++) + (++b) % (c--) - (--a); // 18 + 17 - 18 = 17
    // d8 = d7 + d; // 38 + 17 = 55

    printf("%d %d %d %d", a, b, c, d); // 18 89 23 55
}
*/

/* ТЕМА: ТЕРНАРНЫЙ ОПЕРАТОР */
// Задание 4
/*
int main() {
    // переменная = (условие) ? (выражение 1) : (выражение 2)
    int a = 81, b = 62, c = 23, d;

    d = (a > b) ? ((b < c) ? b : c) : a;

    // d1 = ((b < c) ? b : c); // if (b < c) {d1 = b;} else {d1 = c;} → ans c = 23
    // d2 = (a > b) ? c : a; // if (a > b) {d2 = c;} else {d1 = a;} → ans c = 23

    printf("%d", d); // ans = 23
}
*/

/* ТЕМА: ОБЪЕДИНЕНИЕ СТРОК */
// Задание 5
/*
int main() {
    char s[20] = "mqrxxmvbaevuw"; //(mqrxxmvbaevuw)
    strcat(s, "bjwck"); //(mqrxxmvbaevuw)(bjwck)
    s[16] = '\0'; //mqrxxmvbaevuwbjw
    printf("%s", s + 1); // ans = qrxxmvbaevuwbjw
}
*/

/* ТЕМА: ПОБИТОВЫЕ ОПЕРАТОРЫ */
// Задание 6 
/*int main() {
    int a = 70, b = 68, c = 63, d = 93;
    int d1, d2, d3, d4, d5, d6, d_correct;

    d = a & b + b | c + c ^ d;

    // d_correct = (a & (b + b)) | ((c + c) ^ d);

    // & — поразрядное И
    // ^ — поразрядное исключающее ИЛИ
    // | — поразрядное ИЛИ

    //d1 = b + b; // d1 = 136
    //d2 = c + c; // d2 = 126
    //d3 = a & d1; // d3 = 70 & 136
    //// 01000110
    //// 10001000
    //// 00000000 = 0
    //d4 = d2 ^ d; // d4 = 126 ^ 93
    //// 1111110
    //// 1011101
    //// 0100011 = 35
    //d5 = d3 | d4; // d5 = 35 | 0
    //// 0100011
    //// 0000000
    //// 0100011 = 35

    printf("%d", d5); // ans = 35
}
*/

/* ТЕМА: УКАЗАТЕЛИ */
// Задание 7
/*
int main() {
    int a = 36, b = 25, t1, t2;
    int* p1 = &a, * p2 = &b;

    *p2 = *p2 + (*p1 = *p2 + b) % a;

    t1 = *p1 = *p2 + b; // a = t1 = 50
    t2 = *p2 = (*p2 + (t1)) % a; // b = t2 = (25 + 50) % 50 = 25

    printf("м%d\n", t2);

    printf("%d, %d", a, b); // ans = 50, 25
}
*/

/* ТЕМА: УКАЗАТЕЛИ */
// Задание 8
/*
int main() {
    int a[10] = { 6, 5, 9, 2, 8, 4, 1, 3, 7, 0 }, i, t;
    t = a[1]; // t = a[1] = 5
    for (i = 1; i < 6; i++) // i = 1, 2, 3, 4, 5
        a[i] = a[i + 1]; //a[1] = 9, a[2] = 2, a[3] = 8, a[4] = 4, a[5] = 1
    a[6] = t; // a[6] = t = 5
    t = a[9]; t = 0;
    for (i = 9; i > 4; i--) // i = 9, 8, 7, 6, 5
        a[i] = a[i - 1]; // a[9] = 7; a[8] = 3; a[7] = 5; a[6] = 1; a[5] = 4
    a[4] = t; // a[4] = 0;
    for (i = 0; i < 10; i++) // a[0] = 6+9+2+8+0+4+1+5+3+7!
        printf("%d%c", a[i], (i < 9) ? ('+') : ('!')); //6+9+2+8+0+4+1+5+3+7!
}
*/

/* ТЕМА: МАССИВЫ В ЯЗЫКЕ СИ */
// Задание 9
/*
int main() {
                //0, 1, 2, 3, 4, 5, 6, 7, 8, 9
    int a[10] = { 6, 9, 5, 3, 0, 8, 4, 2, 1, 7 }, s = 0;
    int i;
    for (i = 0; i < 10; i++) { // i = 0, 1, 2, 3, 4, 5, 6, 7, 8, 9
        if ((a[i] - a[0]) < 5 == (a[i] - a[9]) > 5)
            s += a[i];
    // i = 0;
    // ((6 - 6) < 5 == (6 - 7) > 5);
    // s = 0
    //
    // i = 1;
    // ((9 - 6) < 5 == (9 - 7) > 5);
    // s = 0
    //
    // i = 2;
    // ((5 - 6) < 5 == (5 - 7) > 5);
    // s = 0
    //
    // i = 3;
    // ((3 - 6) < 5 == (3 - 7) > 5);
    // s = 0
    //
    // i = 4;
    // ((0 - 6) < 5 == (0 - 7) > 5);
    // s = 0
    //
    // i = 5;
    // ((8 - 6) < 5 == (8 - 7) > 5);
    // s = 0
    //
    // i = 6;
    // ((4 - 6) < 5 == (4 - 7) > 5);
    // s = 0
    //
    // i = 7;
    // ((2 - 6) < 5 == (2 - 7) > 5);
    // s = 0
    //
    // i = 8;
    // ((1 - 6) < 5 == (1 - 7) > 5);
    // s = 0
    // 
    // i = 9;
    // ((7 - 6) < 5 == (7 - 7) > 5);
    // s = 0
    }
    printf("%d", s);
}
*/

/* ТЕМА: УКАЗАТЕЛИ И ССЫЛКИ */
// Задание 10
/*
int main() {
    //          //0, 1, 2, 3, 4, 5, 6, 7, 8, 9
    int a[10] = { 8, 5, 1, 4, 9, 2, 7, 0, 6, 3 };
    int* p = a;

    *p = *(p + 5); // *p = 2 
    p += 5; // p = 2
    *p = *(p - 5); // *p = 4

    for (p = a; p < a + 10; p++) // p
        printf("%d", *p); // ans = 2514947063
}
*/

/* ТЕМА: МАССИВЫ В ЯЗЫКЕ СИ */
// Задание 11
/*
int main() {
              //  0, 1, 2, 3, 4, 5, 6, 7, 8, 9
    int a[10] = { 8, 6, 9, 0, 3, 5, 7, 1, 2, 4 }, s = 0;
    int i; 
    for (i = 1; i < 9; i++) { // i = 1, 2, 3, 4, 5, 6, 7, 8
        if (a[i] < ((a[i - 1] + a[i + 1]) / 2))

        // i = 1; 6 < ((8 + 9) / 2) = 6 < 8 — True s = 0
        // i = 2; 9 < ((6 + 0) / 2) = 9 < 3 — True s = 9  !!!
        // i = 3; 0 < ((9 + 3) / 2) = 0 < 6 — True s = 9
        // i = 4; 3 < ((0 + 5) / 2) = 3 < 2 — True s = 12 !!!
        // i = 5; 5 < ((3 + 7) / 2) = 5 < 5 — True s = 17 !!!
        // i = 6; 7 < ((5 + 1) / 2) = 7 < 3 — True s = 24 !!!
        // i = 7; 1 < ((7 + 2) / 2) = 1 < 4 — True s = 24
        // i = 8; 2 < ((1 + 4) / 2) = 2 < 2 — True s = 26 !!!
            continue;
        s += a[i];
    }
    printf("%d", s); // ans = 26
}
*/

/* ТЕМА: СТРОКИ */
// Задание 12
/*
int main() {    // 0  1  2  3  4  5  6  7  8  9  10 11
                // e  f  q  c  x  w  m  z  t  f  x  o
    char a[20] = "efqcxwmztfxo";
    int i;
    for (i = 3; i < 5; i++) { // i = 3, 4
        a[i] = a[i + 3];

        // i = 3; c = m
        // i = 4; x = z
    }                // start    = e f q (c) (x) w m z t f x o
    printf("%s", a); // true ans = e f q (m) (z) w m z t f x o
}
*/

/* ТЕМА: МАССИВЫ */
// Задание 13
/*
int main() {
    //  a[i][j]
    int a[4][4] = {
    { 3, 2, 0, 1 },    //0
    { 5, 4, 7, 6 },    //1
    { 8, 10, 9, 11 },  //2
    { 12, 13, 14, 15 } //3
    };
    int s = 0, i, j;
    
    for (i = 0; i < 4; i++) { // i = 0, 1, 2, 3
        for (j = 0; j < 4; j++) { // j = 0, 1, 2, 3
            if (i + j < 4) printf("%d", a[i][j]); // ans = 3201547681012
            // a[0][0] < 4 — 3
            // a[0][1] < 4 — 2
            // a[0][2] < 4 — 0
            // a[0][3] < 4 — 1
            // a[1][0] < 4 — 5
            // a[1][1] < 4 — 4
            // a[1][2] < 4 — 7
            // a[1][3] < 4 — 6
            // a[2][0] < 4 — 8
            // a[2][1] < 4 — 10
            // a[2][2] < 4 — 
            // a[2][3] < 4 — 
            // a[3][0] < 4 — 12
            // a[3][1] < 4 — 
            // a[3][2] < 4 — 
            // a[3][3] < 4 — 
        }
    }
}
*/

/* ТЕМА: МАССИВЫ */
// Задание 14
/*
int main() {
    int x = 80; 
    switch (x) {
    case 79: printf("%d", x);
    case 80: printf("%d", x + 1); // 81
    case 81: printf("%d", x - 1); // 79
    }
    // ans = 8179
}
*/

/* ТЕМА: БЕСКОНЕЧНЫЙ ЦИКЛ */
// Задание 15
/*
int main() {
    int s = 0, i = 13;
    while (1) {
        s += i;
        if (s > 100) break;
        i += i; 
        // (1) s = 13; i = 26;
        // (2) s = 39; i = 52;
        // (3) s = 91; i = 104;
        // (4) s = 195; i = 96;
    }
    printf("%d %d", i, s); // ans = 104 195
}
*/

/* ТЕМА: ЦИКЛЫ */
// Задание 16
/*
int main() {
    int a = 152, b = 342, c;
    do {
        c = (a > b) ? (a - b) : (b - a);
        if (a > b) a = c; 
            else b = c;
    } while (a != b);
    
    // (1) 
    // c = b - a = 190;
    // b = c = 190
    // a = 152; b = 190; c = 190;
    // 
    // (2) 
    // c = b - a = 38
    // b = c = 38
    // a = 152; b = 38; c = 38;
    // 
    // (3)
    // c = a - b = 114;
    // a = c = 114;
    // a = 114; b = 38, c = 114;
    //  
    // (4) 
    // c = a - b = 114 - 38
    // a = c = 76;
    // a = 76; b = 38; c = 76;
    // (5)
    // c = a - b = 76 = 38 = 38
    // a = c = 38;
    // a = 38; b = 38; c = 38;

    printf("%d", a);
}
*/